name: "LanguageNet"

layer {
	name: "4gramsDataSet"
	type: "HDF5Data"
	top: "data"
	top: "label"
	hdf5_data_param {
		source: "model/train.txt"
		batch_size: 100
		shuffle: true
	}
	include: { phase: TRAIN }
}

layer {
	name: "4gramsDataSet"
	type: "HDF5Data"
	top: "data"
	top: "label"
	hdf5_data_param {
		source: "model/test.txt"
		batch_size: 100
		shuffle: false
	}
	include: { phase: TEST }
}

layer{
	name: "ipWordEmbedding"
	type: "Embed"
	bottom: "data"
	top: "ipWordEmbedding"
	embed_param {
		input_dim: 251
		num_output: 50
		weight_filler {
    		type: "xavier"
    	}
    	bias_filler {
      		type: "constant"
      		value: 0
    	}
	}
}

layer{
	name: "ipHidden"
	type: "InnerProduct"
	bottom: "ipWordEmbedding"
	top: "ipHidden"
	inner_product_param {
		num_output: 200
		weight_filler {
     		type: "xavier"
    	}
    	bias_filler {
      		type: "constant"
      		value: 0
    	}
	}
}

layer {
  name: "relu1"
  type: "Sigmoid"
  bottom: "ipHidden"
  top: "reluOutput"
}

layer{
	name: "inputToSoftmax"
	type: "InnerProduct"
	bottom: "reluOutput"
	top: "inputToSoftmax"
	inner_product_param {
		num_output: 251
		weight_filler {
     		type: "xavier"
    	}
    	bias_filler {
      		type: "constant"
      		value: 0
    	}
	}
}

layer{
	name: "SoftmaxLoss"
	type: "SoftmaxWithLoss"
	bottom: "inputToSoftmax"
	bottom: "label"
	top: "loss"
}

layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "inputToSoftmax"
  bottom: "label"
  top: "accuracy"
  include: { phase: TEST }
}